import a from '../assets/services/1/1.jpg';
import aa from '../assets/services/1/2.jpg';
import aaa from '../assets/services/1/3.jpg';

import b from '../assets/services/2/1.jpg';
import bb from '../assets/services/2/2.jpg';
import bbb from '../assets/services/2/3.jpg';
import bbbb from '../assets/services/2/4.jpg';

import c from '../assets/services/3/1.jpg';
import cc from '../assets/services/3/2.jpg';
import ccc from '../assets/services/3/3.jpg';

import d from '../assets/services/4/1.jpg';
import dd from '../assets/services/4/2.jpg';
import ddd from '../assets/services/4/3.jpg';
import dddd from '../assets/services/4/4.jpg';

import e from '../assets/services/5/1.jpg';
import ee from '../assets/services/5/2.jpg';

import f from '../assets/services/6/1.jpg';
import ff from '../assets/services/6/2.jpg';
import fff from '../assets/services/6/3.jpg';

import g from '../assets/services/7/1.jpg';
import gg from '../assets/services/7/2.jpg';
import ggg from '../assets/services/7/3.jpg';

import h from '../assets/services/8/1.jpg';
import hh from '../assets/services/8/2.jpg';

import i from '../assets/services/9/1.jpg';
import ii from '../assets/services/9/2.jpg';

import j from '../assets/services/10/1.jpg';
import jj from '../assets/services/10/2.jpg';

import k from '../assets/services/11/1.jpg';
import kk from '../assets/services/11/2.jpg';
import kkk from '../assets/services/11/3.jpg';

import l from '../assets/services/12/1.jpg';
import ll from '../assets/services/12/2.jpg';

import m from '../assets/services/13/1.jpg';
import mm from '../assets/services/13/2.jpg';
import mmm from '../assets/services/13/3.jpg';

import n from '../assets/services/14/1.jpg';
import nn from '../assets/services/14/2.jpg';
import nnn from '../assets/services/14/3.jpg';

import o from '../assets/services/15/1.jpg';
import oo from '../assets/services/15/2.jpg';

import p from '../assets/services/16/1.jpg';
import pp from '../assets/services/16/2.jpg';
import ppp from '../assets/services/16/3.jpg';

import q from '../assets/services/17/1.jpg';

export const IMAGE_WASH = [
	{
		card: {
			main: l,
			details: [ll],
			description: 'Мойка двигателя специальным составом, продувка.',
			price: 500,
		},
	},
	{
		card: {
			main: o,
			details: [oo],
			description:
				'3-х фазная мойка кузова: Предварительная мойка с химией без фосфатов.	Ручная мойка шампунем. Консервация кузова - идеальный блеск и гидрофоб без разводов. Турбосушка или  микрофибра',
			price: 700,
		},
	},
	{
		card: {
			main: p,
			details: [pp, ppp],
			description:
				'Комплексная мойка: мойка кузова, влажная уборка салона, чистка стекол, пылесос салона, обработка полиролью дверных карт, панели.',
			price: 600,
		},
	},
	{
		card: {
			main: q,
			details: [],
			description: 'Наружyняя мойка, сушка и мытье ковриков.',
			price: 350,
		},
	},
];

export const IMAGE_DETAILING = [
	{
		card: {
			main: d,
			details: [dd, ddd, dddd],
			description:
				'Что входит в услугу? 			Консультация мастера по химчистке салона автомобиля. 			Мойка кузова автомобиля. 			Мойка дверных проёмов. 			Визуальный осмотр салона, выявление дефектов, пятен, работоспособности кнопок, электрики. 			Полная химчистка автомобиля и багажника инструментом "торнадор" с использованием профессиональной  автохимии. 			Обработка кожи салона специальными консервационными составами. 			Обработка пластиковых деталей салона защитным составом. 			Чистка и пропитка уплотнителей дверных проемов специальным составом. 			Сушка салона авто специальным пылесосом. 			Очистка всех стекол. 			Мы используем только лучшее оборудование и химию для химчистки высочайшего класса от Koch Chemie (Германия) – рекомендованную такими производителями как BMW, Mercedes, Audi… Абсолютная безопасность, полная гипоаллергенность, отсутствие неприятных запахов – лучшая химчистка возможна только с применением профессиональных материалов.',
			price: 8000,
		},
	},
	{
		card: {
			main: e,
			details: [ee],
			description: `Мойка двигателя осуществляется по технологии Koch Chemie* с помощью диэлектрического состава Golden Star. Состав наносится при помощи специального пневматического инструмента, исключительно на остывший двигатель! Вода используется только на этапе смыва состава, при минимальном давлении. Сушка после мойки осуществляется сжатым воздухом с удлиненной насадкой. По окончанию работ, производится консервация поверхностей составом Motor Plast от Koch Chemie*.
			Что входит в услугу?	Визуальный осмотр подкапотного пространства на предмет целостности и работоспособности узлов и агрегатов.		Проверка работы двигателя на отсутствие посторонних шумов.		Очистка поверхностей двигателя при помощи специального гелеобразного средства, которое создаетпленку, предотвращая попадание воды в места электронных схем и соединений электрики.			Ручная механическая чистка двигателя и моторного отсека.			Аккуратная сушка подкапотного пространства турбо-осушителем.			Консервация поверхности двигателя специальным консервантом.			Обработка деталей из пластика нано-составом.`,
			price: 3000,
		},
	},
	{
		card: {
			main: i,
			details: [ii],
			description: `Профессиональная автомойка авто.Детейлинг-мойка автомобиля - это поэтапная мойка кузова автомобиля с применением высокомолекулярных автошампуней, которые помимо очищения кузова, образуют на его поверхности тончайший консервационный слой, препятствующий загрязнению поверхности продолжительное время.`,
			price: 1000,
		},
	},
	{
		card: {
			main: c,
			details: [cc, ccc],
			description: `Этап 1)
			Двухфазная мойка кузова с использованием крупнопористой губки и различных щеток и кистей для труднодоступных мест.
			Этап 2)
			Очищение кузова от реагентов, битума, металлических вкраплений
			Этап 3)
			Химчистка дисков с использованием специальных составов для удаления желтого налета, битума, металлических вкраплений от колодок
			Этап 4)
			Полировка кузова, фар и фонарей
			Этап 5)
			Удаление остатков пасты и очередная мойка кузова
			Этап 6)
			Нанесение спец состава на шины, который придают первозданный вид
			Этап 7)
			Предпродажная легкая химчистка салона (уборка салона, удаление пятен и различных загрязнений, очистка стекол)
			Этап 8)
			Ручная полировка декоративных вставок ( придание блеска)
			Этап 9)
			😎 😎 😎
			Предоставляем качественные фотографии Вашего автомобиля`,
			price: 10000,
		},
	},
];

export const IMAGE_POLISHING = [
	{
		card: {
			main: f,
			details: [ff, fff],
			description: `Что входит в услугу полировки декоративных вставок салона автомобиля:

			Консультация специалиста по полировке авто
			Визуальный осмотр состояния декоративных вставок и элементов интерьера
			Демонтаж (при необходимости)
			Удаление загрязнений с поверхности вставок
			Обезжиривание поверхности декоративных вставок
			Оклейка бумажным скотчем отдельных элементов, которые не подлежат полировке
			Бережная полировка декоративных элементов`,
			price: 3000,
		},
	},
	{
		card: {
			main: g,
			details: [gg, ggg],
			description: `Что входит :
			1.Двухфазная нано мойка кузова (koch chemie)
			2.Глубока очистка ЛКП от въевшихся загрязнений с помощью пластилина(песок,битум,вкрапления металла).
			3.Полировка кузова с подбором определенной пасты под данный авто.
			
			Цена указана в зависимости от класса авто`,
			price: 10000,
		},
	},
	{
		card: {
			main: h,
			details: [hh],
			description: `Полировка фар. Цена за пару.`,
			price: 2000,
		},
	},
];

export const IMAGE_PROTECTION = [
	{
		card: {
			main: a,
			details: [aa, aaa],
			description: `Оклейка авто антигравийной плёнкой из прозрачного и высокопрочного материала помогает избежать повреждения лакокрасочного покрытия автомобиля, вызванных попаданием на кузов мелких камней, мусора, дорожных реагентов, нефтепродуктов и других химических воздействий. Антигравийная плёнка препятствует выгоранию кузова вашего автомобиля на солнце, и не даёт возможности появиться сколам и царапинам.`,
			price: 1000,
		},
	},
	{
		card: {
			main: b,
			details: [bb, bbb, bbbb],
			description: `Ceramic Pro Leather,Ceramic Pro Plastic

			Поверхность очень легко очищается
			Гидрофобный (водоотталкивающий) эффект
			Обновление и насыщение поверхности
			Стойкость к воздействию солнечных лучей
			Срок службы 7–9 месяцев`,
			price: 5000,
		},
	},
	{
		card: {
			main: m,
			details: [mm, mmm],
			description: `Покрытие стекол: Цена указана за ветровое и передние боковые стекла составом антидождь, антилед.`,
			price: 1500,
		},
	},
	{
		card: {
			main: n,
			details: [nn, nnn],
			description: `Включает в себя : 2х фазную мойку авто,Очистка ЛКП ,покрытие Твердым воском.
			Цена указана без учета стоимости очистки кузова от битума, вкраплений.`,
			price: 3000,
		},
	},
];

export const IMAGE_DRY_CLEAN = [
	{
		card: {
			main: j,
			details: [jj],
			description: `Химчистка автомобиля – обычная уборка салона никогда не заменит собой комплекс услуг по полной химчистке Вашего авто. Пыль и грязь скапливается в скрытых полостях, въедается в покрытия салона, переносится на Вашу одежду, оседает в легких, пагубно влияет на здоровье Ваших пассажиров. Напугали? Не волнуйтесь, всего то приезжайте к нам – и Ваш автомобиль станет чище, чем с завода. Мы используем только лучшее оборудование и химию для химчистки высочайшего класса .`,
			price: 5500,
		},
	},
	{
		card: {
			main: k,
			details: [kk, kkk],
			description: `Чистка дисков - удаление битума, накипи от колодок (лицевая часть).
			Цена указана за 1 диск:
			r13-15 (150)
			r16-17(180)
			r18-19(200)
			r20-22(250)`,
			price: 150,
		},
	},
];

export const IMAGES_CATEGORY = [
	IMAGE_WASH,
	IMAGE_DETAILING,
	IMAGE_POLISHING,
	IMAGE_PROTECTION,
	IMAGE_DRY_CLEAN,
];
